In [2]:
import pandas as pd

In [6]:
df=pd.read_csv("D:\divya_daiict\FOML_lab\lab-02\\202518042_assignment2\\assignment2\\books.csv")
df

,availability,price,rating,title
0,In stock,£51.77,Three,A Light in the Attic
1,In stock,£53.74,One,Tipping the Velvet
2,In stock,£50.10,One,Soumission
3,In stock,£47.82,Four,Sharp Objects
4,In stock,£54.23,Five,Sapiens: A Brief History of Humankind
...,...,...,...,...
995,In stock,£55.53,One,Alice in Wonderland (Alice's Adventures in Won...
996,In stock,£57.06,Four,"Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)"
997,In stock,£16.97,Five,A Spy's Devotion (The Regency Spies of London #1)
998,In stock,£53.98,One,1st to Die (Women's Murder Club #1)
999,In stock,£26.08,Five,"1,000 Places to See Before You Die"

In [7]:
#check 5 values of dataframe
df.head(5)

  availability   price rating                                  title
0     In stock  £51.77  Three                   A Light in the Attic
1     In stock  £53.74    One                     Tipping the Velvet
2     In stock  £50.10    One                             Soumission
3     In stock  £47.82   Four                          Sharp Objects
4     In stock  £54.23   Five  Sapiens: A Brief History of Humankind

In [ ]:
df.columns

Index(['availability', 'price', 'rating', 'title'], dtype='object')

In [14]:
df.isnull().value_counts

<bound method DataFrame.value_counts of      availability  price  rating  title
0           False  False   False  False
1           False  False   False  False
2           False  False   False  False
3           False  False   False  False
4           False  False   False  False
..            ...    ...     ...    ...
995         False  False   False  False
996         False  False   False  False
997         False  False   False  False
998         False  False   False  False
999         False  False   False  False

[1000 rows x 4 columns]>

In [ ]:
#rename column names in dataframe
df.rename(columns={'availability': 'Availability', 'price': 'Price','rating':'Rating','title':'Title'}, inplace=True)

In [16]:
df.head(5)

  Availability   Price Rating                                  Title
0     In stock  £51.77  Three                   A Light in the Attic
1     In stock  £53.74    One                     Tipping the Velvet
2     In stock  £50.10    One                             Soumission
3     In stock  £47.82   Four                          Sharp Objects
4     In stock  £54.23   Five  Sapiens: A Brief History of Humankind

In [17]:
# convert rating to numeric values
rating = {
    'One': 1,
    'Two': 2,
    'Three': 3,
    'Four': 4,
    'Five': 5
}
df['Rating'] = df['Rating'].map(rating)

In [18]:
df.head(5)

  Availability   Price  Rating                                  Title
0     In stock  £51.77       3                   A Light in the Attic
1     In stock  £53.74       1                     Tipping the Velvet
2     In stock  £50.10       1                             Soumission
3     In stock  £47.82       4                          Sharp Objects
4     In stock  £54.23       5  Sapiens: A Brief History of Humankind

In [ ]:
#check if there are null values 
df.isnull().sum()

Availability    0
Price           0
Rating          0
Title           0
dtype: int64

In [ ]:
#remove spaces around title attribute
df['Title'] = df['Title'].str.strip()

In [21]:
df

,Availability,Price,Rating,Title
0,In stock,£51.77,3,A Light in the Attic
1,In stock,£53.74,1,Tipping the Velvet
2,In stock,£50.10,1,Soumission
3,In stock,£47.82,4,Sharp Objects
4,In stock,£54.23,5,Sapiens: A Brief History of Humankind
...,...,...,...,...
995,In stock,£55.53,1,Alice in Wonderland (Alice's Adventures in Won...
996,In stock,£57.06,4,"Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)"
997,In stock,£16.97,5,A Spy's Devotion (The Regency Spies of London #1)
998,In stock,£53.98,1,1st to Die (Women's Murder Club #1)
999,In stock,£26.08,5,"1,000 Places to See Before You Die"

In [27]:
df.dtypes

Availability    object
Price           object
Rating           int64
Title           object
dtype: object

In [ ]:
#convert price attribute datatype to float by removing  euros symbol from price
df['Price'] = df['Price'].str.replace('£', '', regex=False)

df['Price'] = df['Price'].astype(float)

In [33]:
df.dtypes

Availability     object
Price           float64
Rating            int64
Title            object
dtype: object

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Availability  1000 non-null   object
 1   Price         1000 non-null   float64
 2   Rating        1000 non-null   int64
 3   Title         1000 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 31.4+ KB

In [35]:
df.describe()

            Price       Rating
count  1000.00000  1000.000000
mean     35.07035     2.923000
std      14.44669     1.434967
min      10.00000     1.000000
25%      22.10750     2.000000
50%      35.98000     3.000000
75%      47.45750     4.000000
max      59.99000     5.000000